# LineLightShape Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LineLightShape Properties
LineLightShape Class See Also
---
The LineLightShape type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EmitLength | The emit length. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from LightShape.) |

# See Also
LineLightShape Class
Autodesk.Revit.DB.Lighting Namespace